In [8]:
import pandas as pd
import gspread
from sqlalchemy import Column, Integer
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base

In [9]:
engine = create_engine('postgresql+psycopg2://admin:7410@localhost/algebra')

In [10]:
df = pd.read_sql_table("customer_data", engine)

In [11]:
df

    customer_id customer_name               date  gender
0             1        Broddy      Asia/Shanghai    Male
1             2         Willa   America/New_York  Female
2             3         Daren  America/Guatemala    Male
3             4         Ryann     Asia/Chongqing  Female
4             5        Britte       Europe/Paris  Female
..          ...           ...                ...     ...
95           46        Myrtle       Asia/Jakarta  Female
96           47       Antonie  Africa/Porto-Novo  Female
97           48        Pattin   America/New_York    Male
98           49           Gar   Europe/Mariehamn    Male
99           50      Panchito       Europe/Minsk    Male

[100 rows x 4 columns]

In [12]:
df2 = pd.read_csv("MOCK_DATA.csv")
df2

    customer_id customer_name                       date  gender
0             1    Marcelline             America/Bogota  Female
1             2        Lucais              Europe/Prague    Male
2             3        Braden                 Asia/Kabul    Male
3             4       Sydelle              Asia/Damascus  Female
4             5         Joete               Africa/Accra  Female
..          ...           ...                        ...     ...
95           96        Orsola               Asia/Jakarta  Female
96           97        Chaddy              Africa/Douala    Male
97           98          Jack  America/Argentina/Cordoba    Male
98           99     Brittaney                  Asia/Baku  Female
99          100     Bobinette               Asia/Bishkek  Female

[100 rows x 4 columns]

In [13]:
df2.to_sql("customer_data",
          con=engine, index=False, if_exists='append')

100

In [14]:
df2

    customer_id customer_name                       date  gender
0             1    Marcelline             America/Bogota  Female
1             2        Lucais              Europe/Prague    Male
2             3        Braden                 Asia/Kabul    Male
3             4       Sydelle              Asia/Damascus  Female
4             5         Joete               Africa/Accra  Female
..          ...           ...                        ...     ...
95           96        Orsola               Asia/Jakarta  Female
96           97        Chaddy              Africa/Douala    Male
97           98          Jack  America/Argentina/Cordoba    Male
98           99     Brittaney                  Asia/Baku  Female
99          100     Bobinette               Asia/Bishkek  Female

[100 rows x 4 columns]

In [15]:
df_appended = pd.read_sql_table("customer_data", engine)
df_appended

     customer_id customer_name                       date  gender
0              1        Broddy              Asia/Shanghai    Male
1              2         Willa           America/New_York  Female
2              3         Daren          America/Guatemala    Male
3              4         Ryann             Asia/Chongqing  Female
4              5        Britte               Europe/Paris  Female
..           ...           ...                        ...     ...
195           96        Orsola               Asia/Jakarta  Female
196           97        Chaddy              Africa/Douala    Male
197           98          Jack  America/Argentina/Cordoba    Male
198           99     Brittaney                  Asia/Baku  Female
199          100     Bobinette               Asia/Bishkek  Female

[200 rows x 4 columns]